chat_system_1267836130_actor_description=Earl Argus.
chat_system_1267836130_snap_0_question=^?^What can you do? I do need your help, and I will hire you with great pleasure. It's a very delicate situation, so promise not to laugh!<br>You see, I always dreamed of marrying an enchanted princess. I read a lot about it in fairy-tales! After I grew up, I managed to find out what these unusual creatures are. It turns out that enchanted princesses are frogs. It is said that if you kiss such a frog, she'll become a beautiful young lady and a caring wife.
chat_system_1267836130_snap_0_answer_0=^?^How can I help?
chat_system_1267836130_snap_1_question=^?^I want to ask you to go to the swamp. Please bring me a frog. As a reward I'll tell you how to turn one into a real princess. Maybe you'll find yourself a good wife too.<br>You needn't go far; there are plenty of frogs in Marshan Swamp! It is to the west of the capital.<br>[reward]
chat_system_1267836130_snap_1_answer_0=^?^Ok, I'll find a frog for you...
chat_system_1267836130_snap_1_answer_1=^?^To the swamp? Let's do this instead: next time I'm headed that way, I'll come here first, and you can tell me everything then, ok?
chat_system_1267836130_snap_2_question=^?^Ok. But know that at present I cannot make the trip myself. I would hate to run into any problems with dwarves, and I can't leave my castle unattended.
chat_system_1267836130_snap_2_answer_0=^?^Alright, then, see you later.
chat_system_1267836130_snap_5_question=^?^Well, have you brought the love potion?
chat_system_1267836130_snap_5_answer_0=^?^Not yet, I haven't talked to Helga yet. 
chat_system_1267836130_snap_5_answer_1=^?^Here it is... take your potion. 
chat_system_1267836130_snap_6_question=^?^Excellent! I decided to stop messing about with all these frogs. There are a lot of beautiful girls, so I will just choose the most beautiful one, drink the love potion and fall in love with her forever!<br>So, you can return the frogs to the swamp. I'll open the dungeon of my castle for you. I shall have no more need for enchanted frogs.<br>[reward]
chat_system_1267836130_snap_6_answer_0=^?^I'm sure you'll find your true love. Good luck, earl.
chat_system_1267836130_snap_4_question=^?^A normal girl? And really fall in love? Hmm... That's a great idea, I'll try it! Now what's the best way to find one.... All the normal girls I know keep turning back into frogs! But wait - that's it! I've got it!<br>But I shall need the help of Helga, the witch from the Snakes' Underground. Listen, friend, it's not far from here - in the forest, back from the road, the entrance is under a skull. Go and tell the witch that I need the best love potion she's got.
chat_system_1267836130_snap_4_answer_0=^?^You know, it just might work. Alright, I'll find your witch.
chat_system_1267836130_snap_4_answer_1=^?^I don't want to visit witches! Settle the matter yourself.
chat_system_1267836130_snap_7_question=^?^It means that I shall have to keep tormenting miserable frogs. Listen, maybe I should kiss them differently? Or, maybe I should first remove their skin?
chat_system_1267836130_snap_7_answer_0=^?^Hey, stop talking like that, you creep! Alright, I'll go to Helga for the potion.
chat_system_1267836130_snap_3_question=^?^Greetings to you again, [player]. Where is my frog? Come on, give it to me!
chat_system_1267836130_snap_3_answer_0=^?^I haven't been at the swamp yet. Please be patient.
chat_system_1267836130_snap_3_answer_1=^?^Here is your frog! Take it! Her name is Feanora!
chat_system_1267836130_snap_3_answer_2=^?^You know, there is a problem with the frogs...
chat_system_1267836130_snap_8_question=^?^What a beautiful frog! A real princess. Let me kiss you...<br>Well, [player]. What a wonderful present you have made for me! Very well done! You shall always be welcome in my castle.<br>[reward]
chat_system_1267836130_snap_8_answer_0=^?^Thank you, earl! Be happy!
chat_system_1267836130_snap_5_answer_2=^?^You promised me that you would open the entrance to your dungeon, where you keep frogs.
chat_system_1267836130_snap_9_question=^?^Don't worry, I will open it. But first you have to bring me the love potion from Helga, as we arranged.
chat_system_1267836130_snap_9_answer_0=^?^Ok. I will get it for you soon.
